{
  "level_name": "the Swamp",
  "quest": "Find Asphodel Meadows",
  "entrance_description": "As you venture forward, the environment shifts and morphs around you, leading you to a vast, foggy swamp. The air is thick and damp, clinging to your skin like a cold, wet blanket. Each step you take is met with the squelch of the marshy ground beneath your feet.",
  "npcs": [
    {
      "name": "girl sitting by the river",
      "dialogue_file_path": "./assets/dialogues/the_girl.txt",
      "coordinates": [4, 4]
    }
  ],
  "monsters": [
    {
      "name": "Bogmire Wraith",
      "encounter_message": "Out of the eerie mist, the Bogmire Wraith emerges, its ghostly form shifting and shimmering. Eyes glowing like deep swamp lights, it lets out a haunting moan, chilling you to the bone."
    },
    {
      "name": "Mireling Creeper",
      "encounter_message": "With a sudden rustling in the swamp reeds, the Mireling Creeper slinks forward. Its amphibious eyes glint in the fog, and its elongated limbs move with unsettling agility as it approaches."
    },
    {
      "name": "Swampshade Specter",
      "encounter_message": "A chilling whisper fills the air as the Swampshade Specter materializes from the swamp fog. Its translucent form floats eerily above the ground, reaching out with tendrils of ghostly mist."
    },
    {
      "name": "Fen Ghoul",
      "encounter_message": "Lurking in the shadowy undergrowth, the Fen Ghoul reveals itself with a guttural growl. Covered in swamp moss and with eyes like dark pools, it moves towards you with a menacing gait."
    },
    {
      "name": "Marshlight Banshee",
      "encounter_message": "Suddenly, the swamp falls silent before the ear-piercing wail of the Marshlight Banshee pierces the fog. Gliding over the murky water, its spectral form is illuminated by ghostly blue flames."
    }
  ],
  "rows": 5,
  "columns": 5,
  "area_descriptions": [
    "A thick mist hangs over the swamp, obscuring the distant trees and casting ghostly shadows.",
    "The swamp is eerily quiet, with only the occasional distant sound of water dripping.",
    "The still, dark water of the swamp acts like a mirror, reflecting the fog and the twisted shapes of the surrounding trees.",
    "The ground is soft and marshy, squishing underfoot with each step you take.",
    "Twisted, gnarled trees loom overhead, their branches like skeletal hands reaching out through the mist.",
    "The air feels heavy with a sense of sorrow and loss, as if the swamp itself is mourning.",
    "A soft breeze whispers through the reeds, creating a hushed, rustling sound.",
    "You feel as though you're being watched, though no one else is visible in the fog."
  ]
}
